{
  "navbar": {
    "cv": { "es": "CV", "en": "Resume" },
    "proyectos": { "es": "Proyectos", "en": "Projects" },
    "inicio": { "es": "inicio", "en": "home" },
    "inicioTitle": { "es": "Volver al inicio", "en": "Back to home" },
    "githubTitle": {
      "es": "Enlace a mi perfil de GitHub",
      "en": "Link to my GitHub profile"
    },
    "linkedinTitle": {
      "es": "Enlace a mi perfil de LinkedIn",
      "en": "Link to my LinkedIn profile"
    },
    "emailTitle": { "es": "Escribirme un email", "en": "Write me an email" },
    "instagramTitle": {
      "es": "Enlace a mi perfil de Instagram",
      "en": "Link to my Instagram profile"
    },
    "cvTitle": {
      "es": "Enlace a la página de mi CV",
      "en": "Link to my resume page"
    },
    "proyectosTitle": {
      "es": "Enlace a la página de mis proyectos",
      "en": "Link to my projects page"
    },
    "blogTitle": { "es": "Enlace a mi blog", "en": "Link to my blog" },
    "themeTitle": {
      "es": "Cambiar entre modo claro y oscuro",
      "en": "Switch between light and dark mode"
    }
  },
  "cardproyecto": { "es": "Ver proyecto", "en": "View project" },
  "intro": {
    "mas": {
      "es": "¿Querés saber más sobre mi cómo programador?",
      "en": "Do you want to know more about me as a programmer?"
    },
    "mas2": {
      "es": "Podés ver los trabajos que he realizado junto con una explicación detallada de los mismos, los problemas que tuve que superar y los aprendizajes que me dejaron.",
      "en": "You can see the work I have done along with a detailed explanation of it, the problems I had to overcome and what I have learned."
    },
    "mas3": {
      "es": "En mi GitHub encontrarás los repositorios con el código fuente de cada uno de los proyectos que hecho.",
      "en": "In my GitHub you will find the repositories with the source code of each of the projects I have done."
    },
    "mas4": {
      "es": "Mientras aprendo tomo apuntes y los comparto en mi blog.",
      "en": "While I learn I take notes and share them on my blog."
    },
    "mas5": {
      "es": "También podés bajar mi CV en pdf/docx.",
      "en": "You can also download my resume in pdf/docx."
    },
    "mas6": {
      "es": "O ver mi perfil de LinkedIn.",
      "en": "Or see my LinkedIn profile."
    },
    "mas7": {
      "es": "Cuando no estoy programando, hago fotos.",
      "en": "When I'm not programming, I take photos."
    },
    "mas8": {
      "es": "Si me querés contactar, lo mejor es escribirme un mail:",
      "en": "If you want to contact me, write me an email:"
    },

    "podesver": {
      "es": "Podés ver mis",
      "en": "You can see my"
    },
    "proyectos": {
      "es": "proyectos",
      "en": "projects"
    },
    "download": {
      "es": "descargar mi",
      "en": "download my"
    },
    "cvpdf": {
      "es": "CV",
      "en": "Resume"
    },
    "leer": {
      "es": "leer",
      "en": "read"
    },
    "encontrarme": {
      "es": "encontrarme en",
      "en": "find me on"
    },
    "escribirme": {
      "es": "o escribirme a:",
      "en": "or write me to:"
    }
  },
  "cv": {
    "about1": {
      "es": "Sobre mí",
      "en": "About me"
    },
    "about2": {
      "es": "¡Hola, soy Fede! 👾 Hace muchos muchos años me recibí de técnico en computación, conseguí mi primer trabajo como programador y comencé la carrera de Ciencias de la Computación. Pero pasaron cosas y cometí el error de dejarlo todo. 🤦🏻😭☠️ En los años que siguieron fui sociólogo y profesor en escuelas secundarias y en la Universidad de Buenos Aires. Pero desde hace un tiempo el desarrollo web volvió despertar mi curiosidad 🤯, y ¡me atrapó! 🕸️ Tanto qué nuevamente decidí que era hora de cambiar, para poder dedicarme cada día a estudiar y a programar, y desde entonces no he parado. 🧑‍💻🚀",
      "en": "Hi, I'm Fede! 👾 Many many years ago I graduated as a computer technician, got my first job as a programmer and started the Computer Science career. But some unexpected tragedies led me to make the mistake of quitting it all. 🤦🏻😭☠️ In the following years I was a sociologist and a teacher in high schools and at the University of Buenos Aires. But for some time now web development has reawakened my curiosity 🤯, and it caught me! 🕸️ So much so that I decided that it was time to change again, to be able to dedicate myself every day to study and to program, and since then I have not stopped. 🧑‍💻🚀"
    },
    "about3a": {
      "es": "¡Hola! ¿Cómo andás? Soy Fede 🧑‍💻, desarrollador web enfocado en frontend 🌈 pero con conocimientos y curiosidad por el backend, los web standards, y el software de código abierto. Me inicié como autodidacta y ahora estoy próximo a recibirme en una tecnicatura superior en desarrollo de software. 🚀 Además, en el pasado fui sociólogo, y profesor 👨‍🏫 en escuelas y en la Universidad de Buenos Aires. En mi portfolio (",
      "en": "Hi! How you doing? I'm Fede, a web developer focused on frontend 🌈 but also with knowledge and curiosity about backend, web standards, and open source software. I started as a self-taught and now I am about to get a technical degree on software development. 🚀 Also, in the past I was a sociologist, and a teacher 👨‍🏫 in schools and at the University of Buenos Aires. In my portfolio ("
    },
    "about3b": {
      "es": ") podés ver los proyectos en los que he trabajado, junto con una explicación detallada de los mismos, los problemas que tuve que superar y los aprendizajes que me dejaron (además están los enlaces al código fuente).👾",
      "en": ") you can see the projects I have worked on, along with a detailed explanation of them, the problems I had to overcome and  and what I have learned (also the links to the source code).👾"
    },
    "nombreArchivo": {
      "es": "CV_-_Federico_Holc_-_Desarrollador_Web_-_2024",
      "en": "Resume_-_Federico_Holc_-_Web_Developer_-_2024"
    },
    "heading": { "es": "CURRICULUM VITAE", "en": "RESUME" },
    "downloadPDF": {
      "es": "descargar .pdf",
      "en": "download .pdf"
    },
    "downloadDOC": {
      "es": "descargar .docx",
      "en": "download .docx"
    },
    "calificaciones1": {
      "es": "Resumen de calificaciones",
      "en": "Summary of qualifications"
    },
    "calificaciones2": {
      "es": "Desarrollador web enfocado en frontend. ",
      "en": "Web developer focused on frontend. "
    },
    "calificaciones3": {
      "es": "Mis capacidades y conocimientos técnicos incluyen:",
      "en": "My skills and technical knowledge include:"
    },
    "calificaciones3b": {
      "es": "Además, mi experiencia me ha permitido desarrollar las siguientes habilidades:",
      "en": "My skills and experience include:"
    },
    "calificaciones4": {
      "sk1": {
        "es": "Trabajo con metodologías ágiles (Scrum / Kanban)",
        "en": "Working with agile methodologies (Scrum / Kanban)"
      },
      "sk2": {
        "es": "Trabajo en equipo",
        "en": "Teamwork"
      },
      "sk3": {
        "es": "Comunicación efectiva",
        "en": "Effective communication"
      },
      "sk4": {
        "es": "Iniciativa / autonomía",
        "en": "Initiative / autonomy"
      },
      "sk5": {
        "es": "Gestión del tiempo / responsabilidad",
        "en": "Time management / responsibility"
      },
      "sk6": {
        "es": "Resolución de problemas",
        "en": "Problem solving"
      },
      "sk7": {
        "es": "Escucha activa / empatía",
        "en": "Active listening / empathy"
      },
      "sk8": {
        "es": "Atención al detalle",
        "en": "Attention to detail"
      }
    },
    "proyectos1": { "es": "Proyectos", "en": "Projects" },
    "proyectos2": {
      "es": "Podés encontrar una explicación detallada de cada proyecto y enlaces al código, en mi portfolio online: ",
      "en": "You can find a detailed explanation of each project and links to the source code, on my online portfolio: "
    },
    "proyectos3": {
      "es": "<NuncaSupeProgramar/> Blog de apuntes para aprender desarrollo web",
      "en": "<NuncaSupeProgramar/> Blog of notes for learning web development"
    },
    "proyectos3a": {
      "es": "<NuncaSupeProgramar />",
      "en": "<NuncaSupeProgramar />"
    },
    "proyectos3b": {
      "es": "Blog de apuntes para aprender desarrollo web 👾",
      "en": "Blog of notes for learning web development 👾"
    },
    "proyectos4": {
      "es": "Mi blog para organizar apuntes, aprender, y compartir el conocimiento. Sencillo, rápido, y accesible.",
      "en": "My blog to organize notes, learn, and share knowledge. Simple, fast, and accessible."
    },
    "proyectos5": {
      "es": "Así es, otra aplicación más para tomar notas. =) Pero con algunas características particulares. Y lo mejor: una extensión para el navegador que permite resaltar y guardar textos y enlaces desde cualquier web.",
      "en": "That's right, yet another note-taking application =) But with some particular special features. And the best: a browser extension that allows you to highlight and save texts and links from any web."
    },
    "proyectos6": {
      "es": "Extensión para el navegador Chrome que permite ver imágenes de Instagram a máxima resolución y en pantalla completa, sin distracciones.",
      "en": "Extension for Chrome browser that allows you to view Instagram images at full resolution and in full screen, without distractions."
    },
    "proyectos7": {
      "es": "Disponible en la chrome web store: ",
      "en": "Available at the chrome web store:"
    },
    "proyectos8": {
      "es": "Aplicación que permite llevar registro de tus series favoritas y ver fácilmente cuáles tienen nuevos episodios",
      "en": "Application that allows you to keep track of your favorite series and easily see which ones have new episodes."
    },
    "proyectos9": {
      "es": "Argentina Programa v3.0 - Trabajo final del curso de desarrollo web full stack",
      "en": "Argentina Programa v3.0 - Full stack web development course final work"
    },
    "proyectos9a": {
      "es": "Trabajo final del curso de desarrollo web full stack",
      "en": "Full stack web development course final work"
    },
    "proyectos10": {
      "es": "Sitio web a modo de C.V. online que integra distintas funcionalidades. Además, me permitió reencontrarme felizmente con la programación. =)",
      "en": "Website as an online resume that integrates different functionalities. In addition, it allowed me to to meet again happily with programming =)"
    },
    "proyectos11": {
      "es": "Es una aplicación que permite transformar imágenes de manera sencilla y rápida, sin necesidad de registrarse ni de subir archivos a un servidor. Es también una PWA que se puede instalar en el teléfono y usar offline.",
      "en": "It is an application that allows you to transform images in a simple and fast way, without the need to register or upload files to a server. It is also a PWA that can be installed on the phone and used offline."
    },
    "proyectos12": {
      "es": "",
      "en": ""
    },
    "proyectos13": {
      "es": "FotoYOP te permite transformar imágenes y crear collages de manera sencilla y rápida. Es también una PWA que se puede instalar en el teléfono y usar offline. Foto-V es su complemento ideal: convierte imágenes en videos aplicándoles efectos como panning o zoom in/out.",
      "en": "FotoYOP allows you to transform images and create collages simply and quickly. It is also a PWA that can be installed on the phone and used offline. Foto-V is your ideal complement: it converts images into videos by applying effects such as panning or zoom in/out."
    },
    "proyectos14": {
      "es": "Roll your own auth, al menos una vez en la vida",
      "en": "Roll your own auth, at least once in your life"
    },

    "proyectos15": {
      "es": "JWT Learning Kit es una guía para aprender a desarrollar desde cero un sistema de autenticación en JavaScript usando JSON Web Token. Incluye el código y la explicación de los procesos y conceptos necesarios para su implementación.",
      "en": " JWT Learning Kit is a guide to learn how to develop from scratch an authentication system in JavaScript using JSON Web Token. It includes the code and the explanation of the processes and concepts necessary for its implementation."
    },

    "idiomas1": { "es": "Idiomas", "en": "Languages" },
    "idiomas2a": {
      "es": "Español: ",
      "en": "Spanish: "
    },
    "idiomas2b": {
      "es": "nativo.",
      "en": "native."
    },
    "idiomas2c": {
      "es": "Inglés: ",
      "en": "English: "
    },
    "idiomas2d": {
      "es": "professional working proficiency. First Certificate Exam (B2 First), Cambridge University.",
      "en": "professional working proficiency. First Certificate Exam (B2 First), Cambridge University."
    },
    "academia1": { "es": "Formación Académica", "en": "Education" },

    "academia2a": {
      "es": "Tecnicatura Superior en Desarrollo de Software.",
      "en": "Higher Technician Degree in Software Development."
    },
    "academia2b": {
      "es": "Instituto de Formación Técnica Superior N.º 29 de la Ciudad Autónoma de Buenos Aires.  2023 - a la actualidad (14 materias de 23 aprobadas).",
      "en": "Technical Training Institute No. 29 of the Autonomous City of Buenos Aires.  2023 - to present (14 subjects of 23 approved)."
    },
    "academia3a": {
      "es": "Escuela Técnica en Computación.",
      "en": "Computer Technician."
    },
    "academia3b": {
      "es": "Escuela Técnica Nº 3 Maria Sánchez de Thompson, Ciudad Autónoma de Buenos Aires. 1992 – 1998. Graduated.",
      "en": "Technical School Nº 3 Maria Sánchez de Thompson, Autonomous City of Buenos Aires. 1992 - 1998. Graduated."
    },
    "academia4a": {
      "es": "Licenciatura en Sociología.",
      "en": "Bachelor's Degree in Sociology."
    },
    "academia4b": {
      "es": "Facultad de Ciencias Sociales, Universidad de Buenos Aires. 2002 – 2007. Graduado.",
      "en": "Faculty of Social Sciences, University of Buenos Aires. Buenos Aires. 2002 - 2007. Graduated."
    },
    "academia5a": {
      "es": "Profesorado de Enseñanza Secundaria, Normal y Especial en Sociología.",
      "en": "Professor of Secondary, Normal and Special Education in Sociology."
    },
    "academia5b": {
      "es": "Facultad de Ciencias Sociales, Universidad de Buenos Aires. 2007 – 2009. Graduado.",
      "en": "Faculty of Social Sciences, University of Buenos Aires. 2007 – 2009. Graduated."
    },
    "academia6a": {
      "es": "Especialización Docente de Nivel Superior en Educación Sexual Integral.",
      "en": "Higher Education Specialist in Comprehensive Sexual Education."
    },
    "academia6b": {
      "es": "Instituto Superior del Profesorado Dr. Joaquín V. González. 2017 – 2019. Graduado.",
      "en": "Dr. Joaquín V. González Higher Institute of Teaching. 2017 –2019. Graduated."
    },
    "cursos1": { "es": "Cursos", "en": "Courses" },
    "cursos2a": {
      "es": "Desarrollador Web Full Stack. Argentina Programa v3.0,",
      "en": "Full Stack Web Developer. Argentina Program v3.0,"
    },
    "cursos2b": {
      "es": "Instituto Nacional de Tecnología Industrial (INTI), Ministerio de Economía de la Nación, 2022-2023.",
      "en": "National Institute of Industrial Technology (INTI), Ministry of Economy of the Nation, 2022-2023."
    },
    "cursos3a": {
      "es": "Codo a Codo 4.0 Full Stack JAVA,",
      "en": "Codo a Codo 4.0 Full Stack JAVA,"
    },
    "cursos3b": {
      "es": "Ministerio de Educación de la CABA, 2022.",
      "en": "Ministry of Education of the Autonomous City of Buenos Aires, 2022."
    },
    "cursos4a": {
      "es": "Responsive Web Design,",
      "en": "Responsive Web Design,"
    },
    "cursos4b": {
      "es": " freeCodeCamp.org, 2022.",
      "en": " freeCodeCamp.org, 2022."
    },
    "cursos5a": {
      "es": "JavaScript Algorithms and Data Structures,",
      "en": "JavaScript Algorithms and Data Structures,"
    },
    "cursos5b": {
      "es": "freeCodeCamp.org, 2022.",
      "en": "freeCodeCamp.org, 2022."
    },
    "cursos6a": {
      "es": "Back End Development and APIs,",
      "en": "Back End Development and APIs,"
    },
    "cursos6b": {
      "es": "freeCodeCamp.org, 2022.",
      "en": "freeCodeCamp.org, 2022."
    },
    "cursos7a": {
      "es": "Responsive Web Design / JavaScript Algorithms and Data Structures / Back End Development and APIs,",
      "en": "Responsive Web Design / JavaScript Algorithms and Data Structures / Back End Development and APIs,"
    },
    "cursos7b": {
      "es": "freeCodeCamp.org, 2022.",
      "en": "freeCodeCamp.org, 2022."
    },
    "cursos8a": {
      "es": "AWS Academy Cloud Foundations,",
      "en": "AWS Academy Cloud Foundations,"
    },
    "cursos8b": {
      "es": "AWS Academy, 2024.",
      "en": "AWS Academy, 2024."
    },

    "experiencias1": { "es": "Experiencia Laboral", "en": "Work Experience" },
    "experiencias2a": {
      "es": "Programador. CompuHotel S.A. 1998 – 2002.",
      "en": "Programmer. CompuHotel S.A. 1998 - 2002."
    },
    "experiencias2b": {
      "es": "Desarrollo de software de administración hotelera utilizando Visual Basic, Visual Fox Pro, y bases de datos SQL.",
      "en": "Hotel management software development using Visual Basic, Visual Fox Pro, and SQL databases."
    },
    "experiencias2c": {
      "es": "Diseño y desarrollo de páginas web utilizando HTML, CSS y JavaScript.",
      "en": "Design and development of web pages using HTML, CSS and Javascript."
    },
    "experiencias3a": {
      "es": "Sociólogo. Departamento de Salud Ambiental, Ministerio de Salud, GCABA. 2008 – 2012.",
      "en": "Sociologist. Environmental Health Department, Ministry of Health of the Government of the Autonomous City of Buenos Aires. 2008 - 2012."
    },
    "experiencias3b": {
      "es": "Desarrollo e implementación de instrumentos para el relevamiento de problemáticas ambientales en los Centros de Salud y Acción Comunitaria de la CABA. Capacitación del personal para su utilización.",
      "en": "Development and implementation of instruments for the survey of environmental problems in the Health and Community Action Centers in Buenos Aires. Training of personnel in their use."
    },
    "experiencias3c": {
      "es": "Análisis de datos socio-ambientales con Epi Info, bases de datos y SPSS.",
      "en": "Analysis of socio-environmental data using Epi Info, MS Access databases, and SPSS."
    },
    "experiencias4a": {
      "es": "Profesor y tutor universitario. Universidad de Buenos Aires. 2007 – 2015.",
      "en": "Professor and university tutor. University of Buenos Aires. 2007 - 2015."
    },
    "experiencias4b": {
      "es": "Profesor de Introducción al Pensamiento Científico, Ciclo Básico Común, cátedra Marqués (2007-2011).",
      "en": "Professor of Introduction to Scientific Thinking, Common Basic Cycle, Marqués Chair (2007-2011)."
    },
    "experiencias4c": {
      "es": "Profesor y tutor de Prácticas de la enseñanza. Facultad de Ciencias Sociales, cátedra Pipkin (2009-2015).",
      "en": "Professor and tutor of Teaching Practices. Faculty of Social Sciences, Pipkin Chair (2009-2015)."
    },
    "experiencias5a": {
      "es": "Profesor de enseñanza media. 2010 – a la actualidad.",
      "en": "High school teacher. 2010 - to present."
    },
    "experiencias5b": {
      "es": "Profesor de Sociología, Introducción a las Ciencias Sociales y a las Humanidades, Formación Ética y Ciudadana, e Historia, en escuelas públicas de enseñanza media de la Ciudad Autónoma de Buenos Aires.",
      "en": "Teacher of Sociology, History, Introduction to Social Sciences and Humanities, and Ethics and Citizenship Education in public high schools in the Autonomous City of Buenos Aires."
    }
  },
  "proyectos": {
    "codigo": {
      "es": "código",
      "en": "code"
    },
    "proyecto": {
      "es": "PROYECTO",
      "en": "PROJECT"
    },
    "proyectos": {
      "es": "PROYECTOS",
      "en": "PROJECTS"
    },
    "otros": {
      "es": "Otros proyectos:",
      "en": "Other projects:"
    },
    "otrosVerCodigo": {
      "es": "Ver código",
      "en": "View code"
    },
    "otros1": {
      "es": "Aplicación de escritorio para administrar una clínica de salud (proyecto de curso). Stack: C#, Visual Studio, MySQL.",
      "en": "Desktop application to manage a health clinic (course project). Stack: C#, Visual Studio, MySQL."
    },
    "otros2": {
      "es": "Aplicación móvil para administrar un club deportivo (proyecto de fin de cursada). Stack: Kotlin, Android Studio, SQLite.",
      "en": "Mobile application to manage a sports club (course project). Stack: Kotlin, Android Studio, SQLite."
    },
    "otros3": {
      "es": "Argentina Programa v3.0 - CV Editable (proyecto de curso). Stack: Java, Springboot, Hibernate, MySQL, Angular, HTML, CSS, Bootstrap.",
      "en": "Argentina Programa v3.0 - Editable resume (course project). Stack: Java, Springboot, Hibernate, MySQL, Angular, HTML, CSS, Bootstrap."
    },
    "fotoyop01": {
      "es": "fotoYOP",
      "en": "fotoYOP"
    },
    "fotoyop02": {
      "es": "FotoYOP es una aplicación que permite transformar imágenes de manera sencilla y rápida. Surge de la necesidad de resolver dos problemas. Por un lado, realizar cierto tipo de operaciones específicas sobre imágenes (por ejemplo, para publicarlas en redes sociales), y por otro, hacerlo de manera rápida y sencilla, sin necesidad de registrarse, ni subir archivos a un servidor, simplemente arrastrar y soltar, editar y descargar. Y mejor aún si es en una PWA que se puede instalar también en el teléfono y usar offline.",
      "en": "FotoYOP is an application that allows you to transform images in a simple and fast way. It arises from the need to solve two problems. On the one hand, perform certain specific operations on images (for example, to publish them on social networks), and on the other, do it quickly and easily, without the need to register, or upload files to a server, simply drag and drop, edit and download. And even better if it is in a PWA that can also be installed on the phone and used offline."
    },
    "fotoyop03": {
      "es": "¿Qué tiene de bueno?",
      "en": "What's good about it?"
    },
    "fotoyop04": {
      "es": "No requiere registrarse. A futuro pienso en una opción de registro simplemente para poder guardar presets de las operaciones a realizar.",
      "en": "No registration required. In the future I think of an option to register simply to be able to save presets of the operations to be performed."
    },
    "fotoyop05": {
      "es": "No sube archivos a un servidor. Todo se hace en el navegador.",
      "en": "It does not upload files to a server. Everything is done in the browser."
    },
    "fotoyop06": {
      "es": "Es una PWA, por lo que se puede instalar tanto en una pc como en el teléfono y usar offline.",
      "en": "It is a PWA, so it can be installed on both a PC and a phone and used offline."
    },
    "fotoyop07": {
      "es": "Se pueden realizar transformaciones como agregarle un borde,cambiar las proporciones del lienzo, o convertir a blanco y negro. Algunas de ellas se pueden definir con precision: por ejemplo, al agregarse un borde a la imagen se puede establecer el color utilizando el código hexadecimal, y el tamaño del borde setearlo en píxeles.",
      "en": "Transformations such as adding a border, changing the canvas proportions, or converting to black and white can be performed. Some of them can be defined precisely: for example, when adding a border to the image, the color can be set using the hexadecimal code, and the size of the border can be set in pixels."
    },
    "fotoyop08": {
      "es": "Se mantiene la calidad de las imágenes a la hora de transformarlas y guardarlas.",
      "en": "The quality of the images is maintained when transforming and saving them."
    },
    "fotoyop09": {
      "es": "Sobre el stack",
      "en": "About the stack"
    },
    "fotoyop10": {
      "es": "Comencé a realizar las primeras pruebas y a aprender sobre la Canvas API en vanilla JavaScript, pero a medida que fue creciendo el código y la idea de realizar una SPA decidí continuarlo en Next, ya que también me interesaba la idea de que fuera una PWA y eso podía hacerse de forma relativamente sencilla utilizando la librería Serwist disponible para Next.",
      "en": "I started to carry out the first tests and to learn about the Canvas API in vanilla JavaScript, but as the code and the idea of making a SPA grew, I decided to continue it in Next, since I was also interested in the idea of making it a PWA and that could be done relatively easily using the Serwist library available for Next."
    },
    "fotoyop11": {
      "es": "Aprendizajes y problemas en el camino",
      "en": "Learnings and problems along the way"
    },
    "fotoyop12": {
      "es": "Algo que me motiva de estar llevando adelante este proyecto es que he ido aprendiendo distintas cosas en el camino. Algunas sencillas como realizar un drag and drop para cargar archivos en el navegador, y otras más complejas y que abren un montón de posibilidades para seguir explorando como son el uso de la Canvas API, y la creación de PWAs.",
      "en": "Something that motivates me to be carrying out this project is that I have been learning different things along the way. Some simple ones like making a drag and drop to load files in the browser, and others more complex and that open up a lot of possibilities to continue exploring such as the use of the Canvas API, and the creation of PWAs."
    },
    "fotoyop13": {
      "es": "El uso de una librería como serwist me permitió convertir la aplicación en una PWA de manera sencilla, pero para poder aprovechar realmente todo su potencial de cara a la experiencia del usuario me queda por aprender mucho más sobre el uso de Service Workers, el manejo de cache, etc.",
      "en": "The use of a library like serwist allowed me to easily convert the application into a PWA, but in order to really take advantage of all its potential in terms of the user experience, I have a lot to learn about the use of Service Workers, cache management, etc."
    },
    "fotoyop14": {
      "es": "Trabajar con la Canvas API también requiere de un tiempo de aprendizaje para ir resolviendo los problemas que se presentan, por ejemplo a la hora de trabajar con imágenes de distintos tamaños y formatos, realizar transformaciones, conversiones, etc., y también para poder optimizar el rendimiento de la aplicación. He podido solucionar algunos problemas de rendimiento, pero hay otros que aún no, sobre todo al trabajar con imágenes de gran tamaño. La estrategia que he utilizado ahora es la de trabajar con imágenes de un tamaño acotado a la vista del usuario pero registrar todas las transformaciones necesarias para repetirlas sobre la imagen original cuando se la va a descargar, de modo de resguardar la calidad original. Me gustaría seguir profundizando en esto al menos hasta poder encontrar el límite de lo que puede ofrecer la Canvas API, qué tal vez no sea la herramienta más adecuada para ciertas operaciones, y haya que recurrir a otras herramientas o librerías.",
      "en": "Working with the Canvas API also requires a learning time to solve the problems that arise, for example when working with images of different sizes and formats, making transformations, conversions, etc., and also to be able to optimize the performance of the application. I have been able to solve some performance problems, but there are others that I have not yet, especially when working with large images. The strategy I have used now is to work with images of a size limited to the user's view but record all the necessary transformations to repeat them on the original image when it is going to be downloaded, in order to safeguard the original quality. I would like to continue delving into this at least until I can find the limit of what the Canvas API can offer, which may not be the most appropriate tool for certain operations, and other tools or libraries may have to be used."
    },
    "fotoyop15": {
      "es": "Lograr un diseño responsive para que la aplicación se pueda utilizar tanto en un teléfono cómo en una pc también tuvo sus complicaciones, principalmente a la hora de lograr tener siempre la imagen a la vista del usuario, y adaptar el tamaño del canvas a la pantalla, dependiendo de si la imagen era horizontal o vertical y del tamaño de la pantalla, sobre todo si se modificaba el tamaño de la ventana del navegador. Para ello tuve que utilizar JavaScript para ir calculando los tamaños según cómo se modificaba la pantalla, o según cómo se modificaba el tamaño de la imagen, por ejemplo al agregarle un borde.",
      "en": "Achieving a responsive design so that the application can be used on both a phone and a PC also had its complications, mainly when it came to always having the image in view of the user, and adapting the size of the canvas to the screen, depending on whether the image was horizontal or vertical and the size of the screen, especially if the size of the browser window was modified. For this I had to use JavaScript to calculate the sizes according to how the screen was modified, or according to how the size of the image was modified, for example when adding a border."
    },
    "fotoyop16": {
      "es": "A pesar de que la aplicación está en una etapa inicial, tiene una buena cantidad de código, que he tratado de ir refactorizándolo a medida que avanzaba, tratando de aplicar lo que he ido aprendiendo en el último tiempo, con el objetivo de lograr que sea una aplicación que pueda ir creciendo y a la cual se le puedan ir agregando nuevas funcionalidades.",
      "en": "Although the application is in an initial stage, it has a good amount of code, that I have tried to refactor it as I progressed, trying to apply what I have been learning lately, with the aim of making it an application that can grow and to which new functionalities can be added."
    },
    "fotoyop17": {
      "es": "Muestra general de las funcionalidades de la aplicación.",
      "en": "General display of the application's features."
    },
    "fotoyop18": {
      "es": "Muestra de la aplicación en una ventana reducida como podría ser la de un teléfono.",
      "en": "Display of the application in a reduced window as it could be on a phone."
    },
    "fotoyop19": {
      "es": "Actualización en la versión v0.2: ahora es posible crear collages de dos o más imágenes.",
      "en": "Update in version v0.2: now it is possible to create collages of two or more images."
    },
    "fotoyop20": {
      "es": "Actualización v0.2: el incorporar la posibilidad de crear collages representó un gran desafío, no por la complejidad de las operaciones necesarias para crear el canvas con las imágenes, sino por el hecho de tener que refactorizar el código para poder incorporar una nueva característica que requiere de un proceso distinto por tratarse de múltiples imágenes. Esta nueva característica también llevó a tener que modificar la interfaz del usuario. Más allá del resultado que está a la vista me permitió aprender mucho sobre cómo organizar el código para que sea más fácil de mantener y de incorporar nuevas funcionalidades.",
      "en": "Update v0.2: incorporating the possibility of creating collages represented a great challenge, not because of the complexity of the operations necessary to create the canvas with the images, but because of the fact of having to refactor the code to be able to incorporate a new feature that requires a different process because it involves multiple images. This new feature also led to having to modify the user interface. Beyond the result that is in sight, it allowed me to learn a lot about how to organize the code so that it is easier to maintain and incorporate new functionalities."
    },
    "fotoyopv01": {
      "es": "fotoYOP & foto-V",
      "en": "fotoYOP & foto-V"
    },
    "fotoyopv02": {
      "es": "FotoYOP es una aplicación que permite transformar imágenes de manera sencilla y rápida. Surge de la necesidad de resolver dos problemas. Por un lado, realizar cierto tipo de operaciones específicas sobre imágenes (por ejemplo, para publicarlas en redes sociales), y por otro, hacerlo de manera rápida y sencilla, sin necesidad de registrarse, ni subir archivos a un servidor, simplemente arrastrar y soltar, editar y descargar. Y mejor aún si es en una PWA que se puede instalar también en el teléfono y usar offline.",
      "en": "FotoYOP is an application that allows you to transform images in a simple and fast way. It arises from the need to solve two problems. On the one hand, perform certain specific operations on images (for example, to publish them on social networks), and on the other, do it quickly and easily, without the need to register, or upload files to a server, simply drag and drop, edit and download. And even better if it is in a PWA that can also be installed on the phone and used offline."
    },
    "fotoyopv02b": {
      "es": "Foto-V es su complemento ideal. Nos permite convertir imágenes en videos aplicando efectos como un panning o un zoom in/out (al estilo Ken Burns), y adaptar la imagen al tamaño que queramos, para poder por ejemplo publicarlas fácilmente en redes sociales. Corre también totalmente del lado del cliente.",
      "en": "Foto-V is its ideal complement. It allows us to convert images into videos by applying effects such as panning or zoom in/out (Ken Burns style), and adapt the image to the size we want, so that we can easily publish them on social networks. It also runs completely on the client side."
    },
    "fotoyopv03": {
      "es": "¿Qué tienen de bueno?",
      "en": "What's good about them?"
    },
    "fotoyopv04": {
      "es": "No requieren registrarse. No suben archivos a un servidor. Todo se hace en el navegador. FotoYOP además es una PWA, por lo que se puede instalar tanto en una pc como en el teléfono y usar offline.",
      "en": "No registration required. They do not upload files to a server. Everything is done in the browser. FotoYOP is also a PWA, so it can be installed on both a PC and a phone and used offline."
    },
    "fotoyopv05": {
      "es": "Con fotoYOP se pueden realizar transformaciones como agregarle un borde,cambiar las proporciones del lienzo, o convertir a blanco y negro. Algunas de ellas se pueden definir con precision: por ejemplo, al agregarse un borde a la imagen se puede establecer el color utilizando el código hexadecimal, y el tamaño del borde setearlo en píxeles. Ahora (v0.2) también es posible crear collages de dos o más imágenes.",
      "en": "With fotoYOP you can make transformations such as adding a border, changing the proportions of the canvas, or converting to black and white. Some of them can be defined precisely: for example, when adding a border to the image you can set the color using the hexadecimal code, and the size of the border can be set in pixels. Now (v0.2) it is also possible to create collages of two or more images."
    },
    "fotoyopv06": {
      "es": "Foto-V permite convertir imágenes en videos y configurar al detalle los efectos (como el panning o el zoom in/out), estableciendo su duración, dirección, velocidad, etc. Además, se puede elegir el tamaño del video final y la cantidad de frames por segundo a la que se va a reproducir.",
      "en": "Photo-V allows you to convert images into videos and configure the effects in detail (such as panning or zoom in/out), establishing their duration, direction, speed, etc. Additionally, you can choose the size of the final video and the number of frames per second at which it will be played."
    },
    "fotoyopv07": {
      "es": "Tanto fotoYOP como foto-V pueden trabajar con las imágenes a su máxima resolución a la hora de transformarlas y/o de generar los videos, para así poder lograr un resultado sin perdida calidad.",
      "en": "Both fotoYOP and foto-V can work with images at their maximum resolution when transforming them and/or generating videos, in order to achieve a result without loss of quality."
    },
    "fotoyopv09": {
      "es": "Sobre los stacks",
      "en": "About the stacks"
    },
    "fotoyopv10": {
      "es": "En el caso de fotoYOP, comencé a realizar las primeras pruebas y a aprender sobre la Canvas API en vanilla JavaScript, pero a medida que fue creciendo el código y la idea de realizar una SPA decidí continuarlo en Next, ya que también me interesaba la idea de que fuera una PWA y eso podía hacerse de forma relativamente sencilla utilizando la librería Serwist disponible para Next. Para foto-V, tras haber trabajado con react y next, volví a profundizar en el estudio de algunas JavaScript y de patrones de diseño, por lo que quise utilizar solo vanilla JavaScript para probar hasta que punto podía hacer una SPA sin un framework. Para el diseño también utilicé CSS puro. El renderizado de los videos se realiza con ffmpeg-js, una librería que mediante WebAssembly permite utilizar ffmpeg en el navegador.",
      "en": "In the case of fotoYOP, I began to carry out the first tests and learn about the Canvas API in vanilla JavaScript, but as the code and the idea of ​​​​making a SPA grew, I decided to continue it in Next, since I was also interested in the idea of that it was a PWA and that could be done relatively easily using the Serwist library available for Next. For foto-V, after having worked with react and next, I went back to deepen the study of some JavaScript and design patterns, so I wanted to use only vanilla JavaScript to test to what extent I could make a SPA without a framework. For the design I also used pure CSS. The rendering of the videos is done with ffmpeg-js, a library that, through WebAssembly, allows you to use ffmpeg in the browser."
    },
    "fotoyopv11": {
      "es": "FotoYOP: aprendizajes y problemas en el camino",
      "en": "FotoYOP: learnings and problems along the way"
    },
    "fotoyopv12": {
      "es": "Algo que me motiva de estar llevando adelante este proyecto es que he ido aprendiendo distintas cosas en el camino. Algunas sencillas como realizar un drag and drop para cargar archivos en el navegador, y otras más complejas y que abren un montón de posibilidades para seguir explorando como son el uso de la Canvas API, y la creación de PWAs.",
      "en": "Something that motivates me to be carrying out this project is that I have been learning different things along the way. Some simple ones like making a drag and drop to load files in the browser, and others more complex and that open up a lot of possibilities to continue exploring such as the use of the Canvas API, and the creation of PWAs."
    },
    "fotoyopv13": {
      "es": "El uso de una librería como serwist me permitió convertir la aplicación en una PWA de manera sencilla, pero para poder aprovechar realmente todo su potencial de cara a la experiencia del usuario me queda por aprender mucho más sobre el uso de Service Workers, el manejo de cache, etc.",
      "en": "The use of a library like serwist allowed me to easily convert the application into a PWA, but in order to really take advantage of all its potential in terms of the user experience, I have a lot to learn about the use of Service Workers, cache management, etc."
    },
    "fotoyopv14": {
      "es": "Trabajar con la Canvas API también requiere de un tiempo de aprendizaje para ir resolviendo los problemas que se presentan, por ejemplo a la hora de trabajar con imágenes de distintos tamaños y formatos, realizar transformaciones, conversiones, etc., y también para poder optimizar el rendimiento de la aplicación. He podido solucionar algunos problemas de rendimiento, pero hay otros que aún no, sobre todo al trabajar con imágenes de gran tamaño. La estrategia que he utilizado ahora es la de trabajar con imágenes de un tamaño acotado a la vista del usuario pero registrar todas las transformaciones necesarias para repetirlas sobre la imagen original cuando se la va a descargar, de modo de resguardar la calidad original. Me gustaría seguir profundizando en esto al menos hasta poder encontrar el límite de lo que puede ofrecer la Canvas API, qué tal vez no sea la herramienta más adecuada para ciertas operaciones, y haya que recurrir a otras herramientas o librerías.",
      "en": "Working with the Canvas API also requires a learning time to solve the problems that arise, for example when working with images of different sizes and formats, making transformations, conversions, etc., and also to be able to optimize the performance of the application. I have been able to solve some performance problems, but there are others that I have not yet, especially when working with large images. The strategy I have used now is to work with images of a size limited to the user's view but record all the necessary transformations to repeat them on the original image when it is going to be downloaded, in order to safeguard the original quality. I would like to continue delving into this at least until I can find the limit of what the Canvas API can offer, which may not be the most appropriate tool for certain operations, and other tools or libraries may have to be used."
    },
    "fotoyopv15": {
      "es": "Lograr un diseño responsive para que la aplicación se pueda utilizar tanto en un teléfono cómo en una pc también tuvo sus complicaciones, principalmente a la hora de lograr tener siempre la imagen a la vista del usuario, y adaptar el tamaño del canvas a la pantalla, dependiendo de si la imagen era horizontal o vertical y del tamaño de la pantalla, sobre todo si se modificaba el tamaño de la ventana del navegador. Para ello tuve que utilizar JavaScript para ir calculando los tamaños según cómo se modificaba la pantalla, o según cómo se modificaba el tamaño de la imagen, por ejemplo al agregarle un borde.",
      "en": "Achieving a responsive design so that the application can be used on both a phone and a PC also had its complications, mainly when it came to always having the image in view of the user, and adapting the size of the canvas to the screen, depending on whether the image was horizontal or vertical and the size of the screen, especially if the size of the browser window was modified. For this I had to use JavaScript to calculate the sizes according to how the screen was modified, or according to how the size of the image was modified, for example when adding a border."
    },
    "fotoyopv16": {
      "es": "La aplicación tiene una buena cantidad de código, que he tratado de ir refactorizando a medida que avanzaba, buscando aplicar lo que he ido aprendiendo en el último tiempo, con el objetivo de lograr que pueda ir creciendo y que se le puedan ir agregando nuevas funcionalidades.",
      "en": "The application has a good amount of code, which I have tried to refactor as I progressed, seeking to apply what I have been learning in recent times, with the aim of ensuring that it can grow and that new ones can be added. functionalities."
    },
    "fotoyopv17": {
      "es": "FotoYOP: muestra general de las funcionalidades de la aplicación.",
      "en": "FotoYOP: general display of the application's features."
    },
    "fotoyopv18": {
      "es": "FotoYOP: muestra de la aplicación en una ventana reducida como podría ser la de un teléfono.",
      "en": "FotoYOP: display of the application in a reduced window as it could be on a phone."
    },
    "fotoyopv20": {
      "es": "Actualización v0.2: el incorporar la posibilidad de crear collages representó un gran desafío, no por la complejidad de las operaciones necesarias para crear el canvas con las imágenes, sino por el hecho de tener que refactorizar el código para poder incorporar una nueva característica que requiere de un proceso distinto por tratarse de múltiples imágenes. Esta nueva característica también llevó a tener que modificar la interfaz del usuario. Más allá del resultado que está a la vista me permitió aprender mucho sobre cómo organizar el código para que sea más fácil de mantener y de incorporar nuevas funcionalidades.",
      "en": "Update v0.2: incorporating the possibility of creating collages represented a great challenge, not because of the complexity of the operations necessary to create the canvas with the images, but because of the fact of having to refactor the code to be able to incorporate a new feature that requires a different process because it involves multiple images. This new feature also led to having to modify the user interface. Beyond the result that is in sight, it allowed me to learn a lot about how to organize the code so that it is easier to maintain and incorporate new functionalities."
    },
    "fotoyopv21": {
      "es": "Foto-V: aprendizajes y problemas en el camino",
      "en": "Foto-V: learnings and problems along the way"
    },
    "fotoyopv22": {
      "es": "Uno de los principales problemas que tuve fue que la generación de los videos es un proceso que consume muchos recursos, lo cual me llevó a tener que hacer algo a lo que no estaba habituado en javacript, que es programar pensando en como gestionar la memoria. Por ejemplo, en un momento me encontré con que si no liberaba la memoria que consumía la generación de cada frame/imagen, la aplicación consumía toda la memoria del navegador y crasheaba. Por lo que tuve que implementar un sistema para ir generando los videos por partes, liberando la memoria de los datos que ya no se necesitaban, y juntando luego todo al final.",
      "en": "One of the main problems I had was that generating the videos is a process that consumes a lot of resources, which led me to have to do something that I was not used to doing in javascript, which is programming thinking about how to manage memory. For example, at one point I found that if I didn't free the memory consumed by the generation of each frame/image, the application consumed all the browser's memory and crashed. So I had to implement a system to generate the videos in parts, freeing the memory of the data that was no longer needed, and then putting everything together at the end."
    },
    "fotoyopv23": {
      "es": "La otra gran dificultad tiene que ver con cómo resolver la organización del código y la gestión del estado y de la interfaz del usuario en una aplicación hecha en vanilla JavaScript. Pero fue un problema buscado intencionalmente pues quería ver hasta que punto es viable hacer crecer una aplicación de ese modo y estudiar qué patrones de diseño se pueden utilizar e intentar comprender de ese modo también como funcionan y qué soluciones nos aportan los frameworks de JavaScript. Por he estado leyendo sobre como componentizar y modularizar, estrategias para el renderizado de la interfaz del usuario, patrones de diseño como MVC, flux, pub/sub, observer, proxies, etc. He comenzado de a poco, implementando módulos y funciones que puedan ser testeables, una clase/objeto global con un patrón singleton para manejar una parte del estado, y un event bus para la comunicación entre algunos. Y si bien patrones como el flux me resultan muy interesantes, por ahora no he querido implementar más de lo necesario para no caer en hacer una 'sobreingenieria' que complique más de lo que soluciona. Pero me he quedado con ideas y conocimientos para poner en práctica a medida que la aplicación crezca o en otros proyectos.",
      "en": "The other big difficulty has to do with how to solve the organization of the code and the management of the state and the user interface in an application made in vanilla JavaScript. But it was an intentionally sought-after problem because I wanted to see to what extent it is viable to grow an application in this way and study what design patterns can be used and also try to understand how they work and what solutions JavaScript frameworks provide us. For I have been reading about how to componentize and modularize, strategies for rendering the user interface, design patterns like MVC, flux, pub/sub, observer, proxies, etc. I have started small, implementing modules and functions that can be testable, a global class/object with a singleton pattern to handle a part of the state, and an event bus for communication between some. And although patterns like flux are very interesting to me, for now I have not wanted to implement more than necessary so as not to fall into 'over-engineering' that complicates more than it solves. But I have been left with ideas and knowledge to put into practice as the application grows or in other projects."
    },
    "fotoyopv24": {
      "es": "Foto-V: muestra general de las funcionalidades de la aplicación.",
      "en": "Foto-V: general display of the application's features."
    },
    "jwtlk01": {
      "es": "JWT Learning Kit - Roll your own auth, al menos una vez en la vida",
      "en": "JWT Learning Kit - Roll your own auth, at least once in your life"
    },
    "jwtlk02": {
      "es": "JWT Learning Kit es una guía para aprender a desarrollar desde cero un sistema de autenticación en JavaScript usando JSON Web Token. Incluye el código y la explicación de los procesos y conceptos necesarios para su implementación.",
      "en": "JWT Learning Kit is a guide to learn how to develop from scratch an authentication system in JavaScript using JSON Web Token. It includes the code and the explanation of the processes and concepts necessary for its implementation."
    },
    "jwtlk02b": {
      "es": "La guía tiene su propio sitio web creado con docusaurus:",
      "en": "The guide has its own website created with docusaurus:"
    },
    "jwtlk03": {
      "es": "¿Qué tiene de bueno?",
      "en": "What's good about it?"
    },
    "jwtlk04": {
      "es": "Ya sea por motivos de seguridad o interés económico, se suele recomendar el uso de librerías y servicios de autenticación de terceros. Pero implementar tu propio sistema de autenticación es muy valioso en términos de aprendizaje: permite comprender cómo funciona de conjunto y cuál es la complejidad inherente al problema que se quiere resolver. Además, en el proceso se aprende sobre cookies, sesiones, tokens, cifrado, hashing, etc.",
      "en": " "
    },
    "jwtlk05": {
      "es": "El código que acompaña a la guía es totalmente funcional e incluye los distintos procesos de autenticación, como el registro, el login con usuario y contraseña, el login con Google o Github, el reseteo de la contraseña, etc. Está pensado para que quien quiera lo pueda tomar, modificar (si es necesario) y utilizar en sus propios proyectos.",
      "en": ""
    },
    "jwtlk06": {
      "es": "Además del código, la guía incluye explicaciones sobre los distintos procesos y conceptos necesarios para entender cómo funciona el sistema de autenticación, y cómo se implementan las distintas funcionalidades. En términos de aprendizaje, no alcanza con copiar y pegar código, es necesario entenderlo, y también comprender cuál es el problema que se está queriendo resolver, cuales son las soluciones posibles, qué ventajas y desventajas tiene cada una, etc.",
      "en": " "
    },
    "jwtlk07": {
      "es": "También decidí dejar el código de los tests unitarios (con Vitest)y de los tests end-to-end (con Playwright), para que quien quiera pueda probar el sistema y también aprender a realizar tests para este tipo de aplicaciones.",
      "en": " "
    },
    "jwtlk09": {
      "es": "Sobre el stack",
      "en": "About the stack"
    },
    "jwtlk10": {
      "es": "El frontend está realizado en vanilla JavaScript (además de HTML y CSS), y el backend en Node y Express. Me pareció que no utilizar un framework era mejor en cuanto a aprendizaje, y también para que el código pueda ser adaptado a cualquier otro framework o librería. También pensando en simplicidad y accesibilidad es que decidí no utilizar TypeScript, pero usé JSDoc, para poder comprobar el tipado de los datos y documentar el código. Respecto a la base de datos utilicé SQLite por su simplicidad y por la posibilidad de utilizar también de modo muy sencillo una base de datos SQLite online con Turso.",
      "en": " "
    },
    "jwtlk11": {
      "es": "Aprendizajes y problemas en el camino",
      "en": "Learnings and problems along the way"
    },
    "jwtlk12": {
      "es": "La realización de este proyecto me llevo más tiempo del que me imaginaba, pero también aprendí más de lo que estaba en los planes originales. Pues implementar un sistema de autenticación propio, y querer conocer los fundamentos de por qué se deben hacer las cosas de cierta forma (para garantizar seguridad, o rendimiento), es mucho más que aprender cómo funcionan los JWT. En el camino tuve que aprender sobre encriptación, hashing, cookies, ataques XSS/CSRF y cómo prevenirlos, etc. ¡Y aún me quedan algunas cuestiones pendientes!`",
      "en": " "
    },
    "jwtlk13": {
      "es": "El desarrollo de la app en vanilla JavaScript, me llevó a tener que pensar bien en su diseño y como estructurar el código para hacerlo lo mas modular posible, tanto para que pueda ser reutilizado en otros proyectos como para poder testearlo adecuadamente. A modo de ejemplo, para la base de datos utilicé el patrón de diseño adapter, mediante el cual pude generar un sistema en el que con solo modificar una variable de entorno se puede cambiar de tipo de base de datos.",

      "en": "T "
    },
    "jwtlk14": {
      "es": "testing con mocks? supertest? ",
      "en": " "
    },
    "jwtlk15": {
      "es": "la parte de documentacion dificil, no por escribir, porque habia tomado notas, sino porque para explicar algo hay que entenderlo bien, y si la guia la iban a leer y usar otras personas era una responsabilidad, en ese mismo sentido fue que al documentar fui encontrando pequeños fallos o detalles a corregir, y que no podía dejarlos pasar (seguro sigue habiendo errores pero ninguno que conscientemente haya dejado pasar).",
      "en": " "
    },
    "jwtlk17": {
      "es": "FotoYOP: muestra general de las funcionalidades de la aplicación.",
      "en": "FotoYOP: general display of the application's features."
    },
    "jwtlk18": {
      "es": "FotoYOP: muestra de la aplicación en una ventana reducida como podría ser la de un teléfono.",
      "en": "FotoYOP: display of the application in a reduced window as it could be on a phone."
    },
    "jwtlk20": {
      "es": " ",
      "en": " "
    },
    "jwtlk21": {
      "es": "Foto-V: aprendizajes y problemas en el camino",
      "en": "Foto-V: learnings and problems along the way"
    },
    "jwtlk22": {
      "es": " ",
      "en": " "
    },
    "jwtlk23": {
      "es": " ",
      "en": " "
    },
    "jwtlk24": {
      "es": "Foto-V: muestra general de las funcionalidades de la aplicación.",
      "en": "Foto-V: general display of the application's features."
    },
    "anota01": {
      "es": "ANOTÁ! (Another Note Taking App) & Highlighter",
      "en": "ANOTÁ! (Another Note Taking App) & Highlighter"
    },
    "anota02": {
      "es": "Otra aplicación más para tomar notas. Pero con algunas características que ya quisiera tenerlas en Google Keep. Y lo mejor:  incorpora una extensión para el navegador (highlighter) que permite resaltar y guardar textos y enlaces desde cualquier web.",
      "en": "Yet another note-taking application. But with some features that I would like to have in Google Keep. And the best: it incorporates a browser extension (highlighter) that allows you to highlight and save texts and links from any web."
    },
    "anota03": {
      "es": "¿Qué tiene de bueno?",
      "en": "What's good about it?"
    },
    "anota04": {
      "es": "Permite crear, guardar y editar las notas desde la aplicación. La edición se puede realizar desde donde se ve la nota, sin tener que abrir otra una ventana.",
      "en": "It allows you to create, save and edit notes from the application. The edition can be done from where the note is seen, without having to open another window."
    },
    "anota05": {
      "es": "Las notas se pueden visualizar en modo lista o en modo mosaico, con la posibilidad de mostrar el título y el contenido, o solo el título,para así tener más en notas pantalla.",
      "en": "The notes can be viewed in list mode or in mosaic mode, with the possibility of showing the title and content, or only the title, to have more notes on the screen."
    },
    "anota06": {
      "es": "Cada nota puede tener múltiples etiquetas, que pueden utilizarse como filtros para ver solo algunas de ellas. También se pueden buscar las notas por texto en su título o contenido.",
      "en": "Each note can have multiple tags, which can be used as filters to see only some of them. Notes can also be searched by text in their title or content."
    },
    "anota07": {
      "es": "La extensión para el navegador (Highlighter) permite que simplemente al realizar una selección de texto en cualquier web, el texto se resalte y se guarde. Luego todos los fragmentos de texto seleccionados de una misma URL se pueden enviar a ANOTA y/o ser descargados en un archivo de texto. También se pueden generar notas guardando el enlace de la web, o toda la sesión de enlaces abiertos en el navegador.",
      "en": "The browser extension (Highlighter) allows you to simply make a text selection on any web, the text is highlighted and saved. Then all the selected text fragments from the same URL can be sent to ANOTA and/or downloaded in a text file. You can also generate notes by saving the web link, or the entire session of open links in the browser."
    },
    "anota08": {
      "es": "Mostrar un indicador en las notas que tenían más texto del que se veía en pantalla (sin mostrar las scroll bars), resulto ser un problema dado que hasta entonces no había utilizado React para acceder directamente al DOM mediante useRef. Aquí tuve que hacerlo, ya que la solución que se me ocurrió fue comparar si había diferencia entre el `scrollHeight` y el `clientHeight` del contenedor de la nota y así detectar si había un overflow del texto, y poder mostrar el indicador cuando correspondiera.",
      "en": "Displaying an indicator in the notes that had more text than was visible on the screen (without showing the scroll bars), turned out to be a problem since until then I had not used React to directly access the DOM using useRef. Here I had to do it, since the solution that occurred to me was to compare if there was a difference between the `scrollHeight` and the `clientHeight` of the note container and thus detect if there was an overflow of the text, and be able to show the indicator when appropriate."
    },
    "anota09": {
      "es": "Otras dificultades fueron la creación de un layout para mostrar las notas en modo mosaico, lo cual aún no se puede realizar de forma nativa en CSS. Así como también la implementación de un editor de texto para crear y modificar las notas, dado que el elemento HTML `contenteditable` no es muy versátil. En ambos casos, con la intención de poner rápidamente en funcionamiento la aplicación, opté por usar librerías, pero me quisiera poder estudiar en profundidad esos problemas para poder implementar mis propias soluciones ya que son aspectos importantes del proyecto.",
      "en": "Other difficulties were the creation of a layout to display the notes in mosaic mode, which cannot yet be done natively in CSS. As well as the implementation of a text editor to create and modify the notes, since the HTML element `contenteditable` is not very versatile. In both cases, with the intention of quickly putting the application into operation, I chose to use libraries, but I would like to be able to study those problems in depth in order to implement my own solutions since they are important aspects of the project."
    },
    "anota10": {
      "es": "En cuanto a la extensión del navegador, no fue nada fácil, dado que recientemente se cambió al manifest V3 (lo cual conlleva numerosas modificaciones en las APIs), y no abundan los materiales y ejemplos de código actualizados. Pero valió la pena el esfuerzo porque trabajar en una aplicación que tiene que manejar directamente el DOM me obligó a reforzar los fundamentos de JavaScript. Incluso me llevo a estudiar sobre estructuras de datos para poder resolver un problema que era recorrer el árbol del DOM desde el nodo de inicio de la selección de texto hasta el nodo final, para poder obtener el texto, resaltarlo, etc.",
      "en": "As for the browser extension, it was not easy at all, since it was recently changed to manifest V3 (which entails numerous modifications in the APIs), and there are not many updated materials and code examples. But it was worth the effort because working on an application that has to directly handle the DOM forced me to reinforce the fundamentals of JavaScript. It even led me to study about data structures to be able to solve a problem that was to traverse the DOM tree from the starting node of the text selection to the final node, in order to obtain the text, highlight it, etc."
    },
    "anota11": {
      "es": "Siendo esta la aplicación más grande que he realizado hasta ahora, me resultó aún más evidente la importancia de dedicarle tiempo a tener un código legible, estructurado, documentado, etc., así como también a tener componentes reutilizables y organizados. Es algo en lo que tengo que seguir trabajando y mejorando ya que es fundamental para poder mantener la aplicación e incorporarle nuevas funcionalidades.",
      "en": "Being this the largest application I have made so far, it became even more evident to me the importance of dedicating time to have readable, structured, documented code, etc., as well as having reusable and organized components. It is something I have to continue working on and improving since it is essential to be able to maintain the application and incorporate new functionalities."
    },
    "anota12": {
      "es": "Aprendizajes y problemas en el camino",
      "en": "Learnings and problems along the way"
    },
    "anota13": {
      "es": "Sobre el stack",
      "en": "About the stack"
    },
    "anota14": {
      "es": "Dado que estaba estudiando React, resultaba un oportunidad para poner en práctica el uso de hooks como useContext y useReducer para manejar el estado de la aplicación, así como también de useRef para manipular directamente el DOM.",
      "en": "Since I was studying React, it was an opportunity to put into practice the use of hooks such as useContext and useReducer to manage the state of the application, as well as useRef to manipulate the DOM directly."
    },
    "anota15": {
      "es": "Para el backend utilicé Node y Express por lo sencillo que resulta crear una API REST con endpoints, y que se conecta una base de datos. Implementé una en MySQL sin utilizar un ORM para aprender más sobre el funcionamiento de las bases de datos relacionales. Actualización: debido a la imposibilidad de seguir alojando la base de datos en PlanetScale, aproveche para rehacer el backend utilizando Next.js y una base de datos SQLite.",
      "en": "For the backend I used Node and Express because of how easy it is to create a REST API with endpoints, and that connects to a database. I implemented one in MySQL without using an ORM to learn more about the operation of relational databases. Update: due to the impossibility to continue hosting the database in PlanetScale, I took the opportunity to redo the backend using Next.js and a SQLite database."
    },
    "anota16": {
      "es": "Utilicé CSS modules por componentes, junto con la metodología BEM, con la intención de tener un código CSS claro y mantenible, separado de la lógica de la aplicación.",
      "en": "I used CSS modules by components, together with the BEM methodology, with the intention of having clear and maintainable CSS code, separated from the application logic."
    },
    "anota17": {
      "es": "La extensión está en puro HTML, CSS, y JavaScript. Pero decidí incorporar JSDoc para aprender a utilizarlo, tener un código mejor documentado, y también poder tener type check a través del language server de typescript.",
      "en": "The extension is in pure HTML, CSS, and JavaScript. But I decided to incorporate JSDoc to learn how to use it, have better documented code, and also be able to have type check through the typescript language server."
    },
    "anota18": {
      "es": "Muestra de las distintas posibilidades de visualización de las notas.",
      "en": "Shows the different possibilities of viewing the notes."
    },
    "anota19": {
      "es": "Funcionamiento de la extensión para el navegador.",
      "en": "The browser extension functionality."
    },
    "anota20": {
      "es": "Muestra de la creación de notas y filtrado por etiquetas.",
      "en": "Shows the creation of notes and filtering by tags."
    },
    "ap01": {
      "es": "Argentina Programa v3.0 - Curriculum Vitae",
      "en": "Argentina Programa v3.0 - Resume"
    },
    "ap02": {
      "es": "Es un sitio web a modo de curriculum vitae online que integra distintas tecnologías y funcionalidades. Fue solicitado como trabajo final del curso de desarrollo web full stack de Argentina Programa. Aprendí mucho haciéndolo, pero más importante aún, me permitió reencontrarme felizmente con la programación. =)",
      "en": "It is a website as an online resume that integrates different technologies and functionalities. It was requested as the final work of the full stack web development course of Argentina Program. I learned a lot doing it, but more importantly, it allowed me to happily meet again with programming. =)"
    },
    "ap03": {
      "es": "¿Qué tiene de bueno?",
      "en": "What's good about it?"
    },
    "ap04": {
      "es": "Diseño responsive, adaptable a distintos tamaños de pantalla",
      "en": "Responsive design, adaptable to different screen sizes"
    },
    "ap05": {
      "es": "Autorización de usuario para acceder a la modalidad de edición.",
      "en": "User authorization to access the editing mode."
    },
    "ap06": {
      "es": "Posibilidad de editar los elementos a mostrar en cada una de las secciones, tanto en lo que hace al texto como a las imágenes.",
      "en": "Possibility of editing the elements to be displayed in each of the sections, both in terms of text and images."
    },
    "ap07": {
      "es": "Problemas en el camino y aprendizajes",
      "en": "Problems along the way and learnings"
    },
    "ap08": {
      "es": "No fue sencillo armar el rompecabezas de tecnologías necesarias para que todo funcione, y en algunos aspectos las partes quedaron 'atadas con alambre', ya que no tenía el tiempo necesario para profundizar en las bases de cada herramienta y encontrar la mejor solución posible. ¡Pero funcionó!",
      "en": "It was not easy to put together the puzzle of technologies necessary for everything to work, and in some aspects the parts were 'tied with wire', since I did not have the necessary time to delve into the bases of each tool and find the best possible solution. But it worked!"
    },
    "ap09": {
      "es": "El trabajo me permitió tener una visión general de cómo se integra un desarrollo que incluye un front end y un back end con API y base de datos.",
      "en": "The work allowed me to have an overview of how a development that includes a front end and a back end with API and database is integrated."
    },
    "ap10": {
      "es": "Con Angular comprendí cómo era trabajar con un framework para crear una SPA, y en particular cómo se estructura el código utilizando componentes y cómo se implementa un patrón de diseño MVC. El haber aprendido directamente Angular con TypeScript me obligo a tener que estudiar JavaScrip a posteriori para poder tener un conocimiento de los fundamentos y poder diferenciar que características eran propias de cada tecnología.",
      "en": "With Angular I understood what it was like to work with a framework to create a SPA, and in particular how the code is structured using components and how an MVC design pattern is implemented. Having learned Angular directly with TypeScript forced me to have to study JavaScrip later to be able to have a knowledge of the fundamentals and to be able to differentiate which features were specific to each technology."
    },
    "ap11": {
      "es": "La exigencia de hacer el deploy en un sitio en particular, y que este fuera cambiando varias veces (Heroku, Fly.io, Koyeb) cuando faltaba poco tiempo para la entrega fue un dolor de cabeza. Pero rescato que me permitió conocer distintas opciones y formas de hacer deploys de las aplicaciones.",
      "en": "The requirement to deploy on a particular site, and that it changed several times (Heroku, Fly.io, Koyeb) when there was little time left for delivery was a headache. But I appreciate that it allowed me to know different options and ways to deploy applications"
    },
    "ap12": {
      "es": "Vista de una de las secciones con los botones de edición activados.",
      "en": "View of one of the sections with the edit buttons activated."
    },
    "ap13": {
      "es": "Vista de la ventana de edición de la portada.",
      "en": "View of the cover editing window."
    },
    "ap14": {
      "es": "Portada del sitio web visto en un teléfono.",
      "en": "Cover of the website seen on a phone."
    },
    "insta01": {
      "es": "Es una extensión muy sencilla para el navegador Chrome que permite ver las fotos de Instagram a máxima resolución.",
      "en": "It is a very simple extension for the Chrome browser that allows you to view Instagram photos at full resolution."
    },
    "insta02": {
      "es": "¿Para qué sirve?",
      "en": "What is it for?"
    },
    "insta03": {
      "es": "Quienes disfrutamos de ver y hacer fotos, queremos poder apreciarlas a máxima resolución y en pantalla completa. La extensión busca hacer eso posible, de manera sencilla, y sin tener que recurrir a otra plataforma.",
      "en": "Those of us who enjoy seeing and taking photos, want to be able to appreciate them at full resolution and in full screen. The extension seeks to make that possible, in a simple way, and without having to resort to another platform."
    },
    "insta04": {
      "es": "¿Qué tiene de bueno?",
      "en": "What's good about it?"
    },
    "insta05": {
      "es": "Al tener la extensión activada, en el angulo superior derecho de cada foto aparece un icono de una lupa. Al hacer click sobre el mismo, se abre la imagen a tamaño completo y sin otras distracciones. Luego haciendo click en cualquier lugar de la pantalla se regresa a la página y posición original.",
      "en": "By having the extension activated, in the upper right corner of each photo appears an icon of a magnifying glass. By clicking on it, the image opens to full size and without other distractions. Then by clicking anywhere on the screen you return to the original page and position."
    },
    "insta06": {
      "es": "Algunas ideas para implementar a futuro: que se pueda elegir si se abre la imagen en una nueva pestaña o en la misma, y si se utiliza o no el modo de pantalla completa del navegador; que se pueda generar una galería de imágenes para ver una tras otra a pantalla completa.",
      "en": "Some ideas to implement in the future: that you can choose whether to open the image in a new tab or in the same one, and whether or not to use the browser's full screen mode; that you can generate a gallery of images to see one after another in full screen."
    },
    "insta07": {
      "es": "Problemas en el camino y aprendizajes",
      "en": "Problems along the way and learnings"
    },
    "insta08": {
      "es": "La principal dificultad técnica con la que me encontré es que al ser Instagram de una web dinámica, a medida que aparecen nuevos elementos, es necesario ir agregando listeners e iconos. Pero no encontré un evento que se dispare cuando eso ocurre. La solución que implementé es hacerlo con el evento mouseMove, lo cuál es efectivo pero poco eficiente ya que implica leer toda la estructura de la web muchas más veces de las necesarias. Tengo pendiente buscar una solución más eficiente para este problema. (Si sabés cómo hacerlo ¡por favor escribime!)",
      "en": "The main technical difficulty I encountered is that since Instagram is a dynamic website, as new elements appear, it is necessary to add listeners and icons. But I didn't find an event that fires when that happens. The solution I implemented is to do it with the mouseMove event, which is effective but not very efficient because it involves reading the entire structure of the web many more times than necessary. I have to look for a more efficient solution for this problem (if you know how to do it, please write me!)"
    },
    "insta09": {
      "es": "Otra cuestión que aún debo investigar es como portar la extensión a Firefox, Safari y Edge, de modo tal de no excluir a quiénes utilizan algún otro de los principales navegadores.",
      "en": "Another issue that I still have to investigate is how to port the extension to Firefox, Safari and Edge, so as not to exclude those who use any other of the main browsers."
    },
    "insta10": {
      "es": "También surgió un problema no técnico que no había tenido en cuenta: luego de varias semanas de publicada la extensión, cuando ya tenía más de cien usuarios, me llegó un aviso de que la eliminaban de la chrome web store de Estados Unidos por utilizar la palabra Instagram en el nombre y porque el icono incluía los colores de la marca. Por lo que tuve que cambiar nombre y logo, y volver a publicarla.",
      "en": "There was also a non-technical problem that I had not taken into account: after several weeks of the extension being published, when it already had more than a hundred users, I received a notice that it was being removed from the chrome web store of the United States for using the word Instagram in the name and because the icon included the brand's colors. So I had to change the name and logo, and republish it."
    },
    "insta11": {
      "es": "Hacer un extensión para el navegador me resulto un buena forma de para practicar HTML, CSS y JavaScript sin frameworks de por medio, aprender sobre la manipulación del DOM y ver cómo lo estructuran este tipo de aplicaciones. Pienso ahora que sería interesante programar una alerta que me avise cuando se produzcan modificaciones en el DOM del sitio que hagan que la extensión deje de funcionar.",
      "en": "Making a browser extension was a good way for me to practice HTML, CSS and JavaScript without frameworks in between, learn about DOM manipulation and see how they structure this type of applications. I now think it would be interesting to program an alert that warns me when changes are made to the site's DOM that cause the extension to stop working."
    },
    "insta12": {
      "es": "Lamentablemente no hay tantos contenidos en la web para aprender a desarrollar extensiones por lo que valoro mucho la elaboración de una buena documentación con explicaciones claras y ejemplos de código como la que tiene Chrome de su API.",
      "en": "Unfortunately there is not so much content on the web to learn how to develop extensions, so I greatly value the preparation of good documentation with clear explanations and code examples like the one Chrome has of its API."
    },
    "insta13": {
      "es": "Es muy motivador poder crear algo útil, que funciona, y que se puede compartir con otras personas. Este proyecto me ha dado ganas e ideas para hacer montones de extensiones.",
      "en": "It is very motivating to be able to create something useful, that works, and that can be shared with other people. This project has given me the desire and ideas to make lots of extensions."
    },
    "insta14": {
      "es": "Vista de la extensión funcionando.",
      "en": "View of the extension working."
    },
    "insta15": {
      "es": "Vista de la extensión en la Chrome web store.",
      "en": "View of the extension in the Chrome web store."
    },
    "nsp01": {
      "es": "<NuncaSupe­Programar/> Blog de apuntes para aprender desarrollo web",
      "en": "<NuncaSupe­Programar/> Blog of notes to learn web development"
    },
    "nsp02": {
      "es": "Blog de aprendizaje en público, para organizar mis apuntes y compartir el conocimiento.",
      "en": "Public learning blog, to organize my notes and share knowledge."
    },
    "nsp03": {
      "es": "¿Para qué un blog?",
      "en": "Why a blog?"
    },
    "nsp04": {
      "es": "Algo que aprendí como docente es que junto con la práctica, intentar enseñar o explicar algo (y si es por escrito mejor) es un excelente camino para aprenderlo. También es importante el aprendizaje colectivo que se genera con el intercambio. De allí la creación de un blog, que es una excelente tecnología para la difusión del conocimiento: a diferencia de lo que circula por plataformas cerradas, sus contenidos puede ser indexados por los buscadores, compartidos en redes sociales, y estar a disposición de quienes lo necesiten.",
      "en": "Something I learned as a teacher is that along with practice, trying to teach or explain something (and if it is in writing better) is an excellent way to learn it. Also important is the collective learning that is generated with the exchange. Hence the creation of a blog, which is an excellent technology for the dissemination of knowledge: unlike what circulates on closed platforms, its contents can be indexed by search engines, shared on social networks, and be available to those who need it."
    },
    "nsp05": {
      "es": "¿Qué tiene de bueno?",
      "en": "What's good about it?"
    },
    "nsp06": {
      "es": "Mediante Next.js el blog se genera como sitio estático del lado del servidor, lo cual hace que sea veloz, y fácil de indexar por los buscadores. También es sencillo de publicar, ya que al estar alojado en Vercel, el deploy se realiza automáticamente cada vez que se actualiza el repositorio en GitHub.",
      "en": "Through Next.js the blog is generated as a server-side static site, which makes it fast, and easy to index by search engines. It is also easy to publish, since being hosted on Vercel, the deploy is done automatically every time the repository is updated on GitHub."
    },
    "nsp07": {
      "es": "Añadir nuevas entradas al blog es simple: se escribe el contenido del post en un archivo con formato Markdown, se lo sube a una carpeta dentro del repositorio del proyecto, y automáticamente queda publicado (salvo que se lo marque como borrador).",
      "en": "Adding new entries to the blog is simple: the content of the post is written in a file in Markdown format, it is uploaded to a folder within the project repository, and it is automatically published (unless it is marked as a draft)."
    },
    "nsp08": {
      "es": "Se pueden marcar posteos como destacados para que aparezcan en una sección destacada de la página principal.",
      "en": "Posts can be marked as featured to appear in a featured section of the home page."
    },
    "nsp09": {
      "es": "Utilizando el formato Markdown junto con la librería remark.js se le puede dar formato resaltado a los bloques de código de las publicaciones.",
      "en": "Using the Markdown format together with the remark.js library, highlighted format can be given to the code blocks of the posts."
    },
    "nsp10": {
      "es": "Se pueden filtrar los posts por etiquetas utilizando el buscador o el listado de las mismas.",
      "en": "Posts can be filtered by tags using the search engine or the list of them."
    },
    "nsp11": {
      "es": "Es responsive y se adapta para que pueda ser leído desde cualquier dispositivo.",
      "en": "It is responsive and adapts so that it can be read from any device."
    },
    "nsp12a": {
      "es": "Algunas ideas de nuevas funcionalidades las pruebo en este otro blog:",
      "en": "I test some ideas for new features in this other blog:"
    },
    "nsp12b": {
      "es": "de estructura similar pero en TypeScript. Allí, por ejemplo, implementé un sistema de comentarios para los posts, utilizando Supabase tanto para la autenticación/autorización de usuarios, como para la base de datos",
      "en": "with a similar structure but in TypeScript. There, for example, I implemented a comment system for the posts, using Supabase for both user authentication/authorization and the database."
    },
    "nsp13": {
      "es": "Aprendizajes y problemas en el camino",
      "en": "Learnings and problems along the way"
    },
    "nsp14": {
      "es": "Hasta aquí solo había programando SPAs con renderizado del lado del cliente, por lo que me llevo un tiempo comprender las variantes que hay para hacerlo del lado del servidor (o de manera combinada), y cómo trabajar de ese modo con Next, integrando frontend y backend en una sola aplicación full stack.",
      "en": "Until now I had only programmed SPAs with client-side rendering, so it took me a while to understand the variants that exist to do it on the server side (or in a combined way), and how to work in that way with Next, integrating frontend and backend in a single full stack application."
    },
    "nsp15": {
      "es": "Al poco tiempo de publicado el blog, Next lanzó una nueva versión incorporando React Server Components, y cometí el error de ir tras la novedad, ya que no funcionaban las librerías para el estilizado del Markdown en la nueva versión. Tuve que regresar a la anterior, pero con la lección aprendida sobre la importancia de utilizar tecnologías probadas y consolidadas. Actualización diciembre de 2023: finalmente pude resolver el problema de las dependencias y actualizar a la última versión de Next.",
      "en": "Shortly after the blog was published, Next released a new version incorporating React Server Components, and I made the mistake of going after the novelty, since the libraries for styling the Markdown did not work in the new version. I had to go back to the previous one, but with the lesson learned about the importance of using proven and consolidated technologies. Update December 2023: I was finally able to solve the problem of dependencies and update to the latest version of Next."
    },
    "nsp16": {
      "es": "Publicar el blog en un dominio propio me llevó también a aprender como registrarlo, cómo manejar los DNS, y las configuraciones necesarias para que pueda ser indexado por los buscadores.",
      "en": "Publishing the blog on my own domain also led me to learn how to register it, how to manage the DNS, and the necessary configurations so that it can be indexed by search engines."
    },
    "nsp17": {
      "es": "Artículo del blog con bloques de código, visto en una pantalla amplia.",
      "en": "Blog article with code blocks, seen on a wide screen."
    },
    "nsp18": {
      "es": "Portada del blog vista en un teléfono.",
      "en": "Cover of the blog seen on a phone."
    },
    "tv01": {
      "es": "MyTvShows es una aplicación que permite llevar registro de tus series favoritas y ver fácilmente cuáles tienen nuevos episodios.",
      "en": "MyTvShows is an application that allows you to keep track of your favorite series and easily see which ones have new episodes."
    },
    "tv02": {
      "es": "¿Para qué sirve?",
      "en": "What is it for?"
    },
    "tv03": {
      "es": "La aplicación fue pensada para resolver un problema aparentemente sencillo como el de tener un registro de las series que ha visto o quiere ver, en un solo lugar, y poder saber si hay nuevos episodios sin depender del acceso a las distintas plataformas que existen hoy en día.",
      "en": "The application was designed to solve an apparently simple problem such as having a record of the series that you have seen or want to see, in one place, and being able to know if there are new episodes without depending on access to the different platforms that exist today."
    },
    "tv04": {
      "es": "¿Qué tiene de bueno?",
      "en": "What's good about it?"
    },
    "tv05": {
      "es": "Registro de multiples cuentas de usuario utilizando Supabase Auth.",
      "en": "Register multiple user accounts using Supabase Auth."
    },
    "tv06": {
      "es": "Búsqueda de series en la base de datos de IMDb (Internet Movie Database) mediante el uso de una API, y agregarlas a la lista de favoritos.",
      "en": "Search for series in the IMDb (Internet Movie Database) database using an API, and add them to the favorites list."
    },
    "tv07": {
      "es": "Listado de series favoritas con la correspondiente información respecto a la cantidad de temporadas y a la fecha de emisión del último episodio.",
      "en": "List of favorite series with the corresponding information regarding the number of seasons and the date of airing of the last episode."
    },
    "tv08": {
      "es": "Opción de ordenar el listado de series alfebéticamente o por la fecha del último episodio para así poder ver cuáles son los que han sido emitidos recientemente.",
      "en": "Option to sort the list of series alphabetically or by the date of the last episode to see which ones have been aired recently."
    },
    "tv09": {
      "es": "Funcionalidades para implementar a futuro: poder indicar en cuál es el último episodio que se ha visto de cada serie, junto con una extensión del navegador que nos alerte cuando haya nuevos episodios para ver.",
      "en": "Functionalities to implement in the future: being able to indicate which is the last episode that has been seen of each series, together with a browser extension that alerts us when there are new episodes to watch."
    },
    "tv10": {
      "es": "Problemas y aprendizajes",
      "en": "Problems and learnings"
    },
    "tv11": {
      "es": "Era la primera vez que utilizaba React y quería poner en práctica cuestiones básicas como el uso de componentes, renderizado condicional, manejo de estados y props, etc.",
      "en": "It was the first time I used React and I wanted to put into practice basic issues such as the use of components, conditional rendering, state and props management, etc."
    },
    "tv12": {
      "es": "Un desafío nuevo fue el combinar distintas funciones asíncronas para que trabajen en conjunto, ya que primero debía leer los datos de Firebase, a continuación obtener cierta información de las series desde la API de OpenIMDb, para a luego realizar una nueva solicitud a otro endpoint, y así obtener los datos sobre los episodios de cada serie. Pude resolverlo mediante la utilización de async/await. Pero me queda pendiente profundizar en como abordar los errores cuando algo falla en una de las funciones asíncronas.",
      "en": "A new challenge was to combine different asynchronous functions to work together, since I first had to read the data from Firebase, then obtain certain information about the series from the OpenIMDb API, to then make a new request to another endpoint, and thus obtain the data about the episodes of each series. I was able to solve it by using async/await. But I still have to delve into how to address errors when something fails in one of the asynchronous functions."
    },
    "tv13": {
      "es": "También tuve algunos dolores de cabeza con el uso de UseEffect en relación a la carga de los datos, pero la nueva documentación de React es muy clara en cuanto a cómo usarlo y sobre todo cuando no usarlo, así que pude resolverlo.",
      "en": "I also had some headaches with the use of UseEffect in relation to the loading of the data, but the new React documentation is very clear about how to use it and especially when not to use it, so I was able to solve it."
    },
    "tv14": {
      "es": "Programar desde cero un sistema de autenticación de usuarios era algo que excedía este proyecto, por lo que decidí utilizar Supabase Auth, lo cual me permitió implementarlo de manera sencilla.",
      "en": "Programming from scratch a user authentication system was something that exceeded this project, so I decided to use Supabase Auth, which allowed me to implement it easily."
    },
    "tv15": {
      "es": "Aproveché para probar por primera vez Tailwind CSS, del cual rescato la idea de trabajar con utility clases.",
      "en": "I took the opportunity to try Tailwind CSS for the first time, from which I rescue the idea of working with utility classes."
    },
    "tv16": {
      "es": "Vista de las series guardadas y su información correspondiente.",
      "en": "View of the saved series and their corresponding information."
    },
    "tv17": {
      "es": "Vista del buscador de series.",
      "en": "View of the series search."
    }
  }
}
