{
  "navbar": {
    "cv": { "es": "CV", "en": "Resume" },
    "proyectos": { "es": "Proyectos", "en": "Projects" },
    "inicio": { "es": "inicio", "en": "home" }
  },
  "cardproyecto": { "es": "Ver proyecto", "en": "View project" },
  "intro": {
    "podesver": {
      "es": "Podés ver mis",
      "en": "You can see my"
    },
    "proyectos": {
      "es": "proyectos",
      "en": "projects"
    },
    "download": {
      "es": "descargar mi",
      "en": "download my"
    },
    "cvpdf": {
      "es": "CV en PDF",
      "en": "resume as PDF"
    },
    "leer": {
      "es": "leer",
      "en": "read"
    },
    "encontrarme": {
      "es": "encontrarme en",
      "en": "find me on"
    },
    "escribirme": {
      "es": "escribirme a:",
      "en": "write me to:"
    }
  },
  "cv": {
    "nombreArchivo": {
      "es": "Federico_Holc_CV.pdf",
      "en": "Federico_Holc_Resume.pdf"
    },
    "heading": { "es": "CURRICULUM VITAE", "en": "RESUME" },
    "downloadPDF": {
      "es": "descargar en PDF",
      "en": "download as PDF"
    },
    "calificaciones1": {
      "es": "Resumen de calificaciones",
      "en": "Summary of qualifications"
    },
    "calificaciones2": {
      "es": "Desarrollador web especializado en front-end. ",
      "en": "Web developer specialized in frontend. "
    },
    "calificaciones3": {
      "es": "Mis habilidades y experiencia incluyen:",
      "en": "My skills and experience include:"
    },
    "proyectos1": { "es": "Proyectos", "en": "Projects" },
    "proyectos2": {
      "es": "Podés encontrar una explicación detallada de cada proyecto en mi portfolio online: ",
      "en": "You can find a detailed explanation of each project in my online portfolio: "
    },
    "proyectos3": {
      "es": "👾 <NuncaSupeProgramar/> Blog de apuntes para aprender desarrollo web",
      "en": "👾 <NuncaSupeProgramar/> Blog of notes for learning web development"
    },
    "proyectos3a": {
      "es": "<NuncaSupeProgramar />",
      "en": "<NuncaSupeProgramar />"
    },
    "proyectos3b": {
      "es": "Blog de apuntes para aprender desarrollo web 👾",
      "en": "Blog of notes for learning web development 👾"
    },
    "proyectos4": {
      "es": "Mi blog para organizar apuntes, aprender, y compartir el conocimiento. Sencillo, rápido, y accesible.",
      "en": "My blog to organize notes, learn, and share knowledge. Simple, fast, and accessible."
    },
    "proyectos5": {
      "es": "Así es, otra aplicación más para tomar notas. =) Pero con algunas características particulares. Y lo mejor: una extensión para el navegador que permite resaltar y guardar textos y enlaces desde cualquier web.",
      "en": "That's right, yet another note-taking application =) But with some particular special features. And the best: a browser extension that allows you to highlight and save texts and links from anyweb."
    },
    "proyectos6": {
      "es": "Extensión para el navegador Chrome que permite ver imágenes de Instagram a máxima resolución y en pantalla completa, sin distracciones.",
      "en": "Extension for Chrome browser that allows you to view Instagram images at full resolution and in full screen, without distractions."
    },
    "proyectos7": {
      "es": "Disponible en la chrome web store: ",
      "en": "Available at the chrome web store:"
    },
    "proyectos8": {
      "es": "Aplicación que permite llevar registro de tus series favoritas y ver fácilmente cuáles tienen nuevos episodios",
      "en": "Application that allows you to keep track of your favorite series and easily see which ones have new episodes."
    },
    "proyectos9": {
      "es": "👨‍💻 Argentina Programa v3.0 - Trabajo final del curso de desarrollo web full stack",
      "en": "👨‍💻 Argentina Programa v3.0 - Full stack web development course final work"
    },
    "proyectos9a": {
      "es": "Trabajo final del curso de desarrollo web full stack",
      "en": "Full stack web development course final work"
    },
    "proyectos10": {
      "es": "Sitio web a modo de C.V. online que integra distintas funcionalidades. Además, me permitió reencontrarme felizmente con la programación. =)",
      "en": "Website as an online resume that integrates different functionalities. In addition, it allowed me to to meet again happily with programming =)"
    },
    "idiomas1": { "es": "Idiomas", "en": "Languages" },
    "idiomas2a": {
      "es": "Español: ",
      "en": "Spanish: "
    },
    "idiomas2b": {
      "es": "nativo.",
      "en": "native."
    },
    "idiomas2c": {
      "es": "Inglés: ",
      "en": "English: "
    },
    "idiomas2d": {
      "es": "professional working proficiency. First Certificate Exam (B2 First), Cambridge University.",
      "en": "professional working proficiency. First Certificate Exam (B2 First), Cambridge University."
    },
    "academia1": { "es": "Formación Académica", "en": "Education" },

    "academia2a": {
      "es": "Tecnicatura Superior en Desarrollo de Software.",
      "en": "Higher Technician Degree in Software Development."
    },
    "academia2b": {
      "es": "Instituto de Formación Técnica Superior N.º 29 de la Ciudad Autónoma de Buenos Aires. En curso desde 2023 (9 materias aprobadas).",
      "en": "Technical Training Institute No. 29 of the Autonomous City of Buenos Aires. In progress since 2023 (9 subjects approved)."
    },
    "academia3a": {
      "es": "Técnico en Computación.",
      "en": "Computer Technician."
    },
    "academia3b": {
      "es": "Escuela Técnica Nº 3 Maria Sánchez de Thompson, Ciudad Autónoma de Buenos Aires. 1992 – 1998.",
      "en": "Technical School Nº 3 Maria Sánchez de Thompson, Autonomous City of Buenos Aires. 1992 - 1998."
    },
    "academia4a": {
      "es": "Licenciado en Sociología.",
      "en": "Bachelor's Degree in Sociology."
    },
    "academia4b": {
      "es": "Facultad de Ciencias Sociales, Universidad de Buenos Aires. 2002 – 2007.",
      "en": "Faculty of Social Sciences, University of Buenos Aires. Buenos Aires. 2002 - 2007."
    },
    "academia5a": {
      "es": "Profesor de Enseñanza Secundaria, Normal y Especial en Sociología.",
      "en": "Professor of Secondary, Normal and Special Education in Sociology."
    },
    "academia5b": {
      "es": "Facultad de Ciencias Sociales, Universidad de Buenos Aires. 2007 – 2009.",
      "en": "Faculty of Social Sciences, University of Buenos Aires. 2007 – 2009."
    },
    "academia6a": {
      "es": "Especialista Docente de Nivel Superior en Educación Sexual Integral.",
      "en": "Higher Education Specialist in Comprehensive Sexual Education."
    },
    "academia6b": {
      "es": "Instituto Superior del Profesorado Dr. Joaquín V. González. 2017 – 2019.",
      "en": "Dr. Joaquín V. González Higher Institute of Teaching. 2017 –2019."
    },
    "cursos1": { "es": "Cursos", "en": "Courses" },
    "cursos2a": {
      "es": "Desarrollador Web Full Stack. Argentina Programa v3.0,",
      "en": "Full Stack Web Developer. Argentina Program v3.0,"
    },
    "cursos2b": {
      "es": "Instituto Nacional de Tecnología Industrial (INTI), Ministerio de Economía de la Nación, 2022-2023.",
      "en": "National Institute of Industrial Technology (INTI), Ministry of Economy of the Nation, 2022-2023."
    },
    "cursos3a": {
      "es": "Codo a Codo 4.0 Full Stack JAVA,",
      "en": "Codo a Codo 4.0 Full Stack JAVA,"
    },
    "cursos3b": {
      "es": "Ministerio de Educación de la CABA, 2022.",
      "en": "Ministry of Education of the Autonomous City of Buenos Aires, 2022."
    },
    "cursos4a": {
      "es": "Responsive Web Design,",
      "en": "Responsive Web Design,"
    },
    "cursos4b": {
      "es": "freeCodeCamp.org, 2022.",
      "en": "freeCodeCamp.org, 2022."
    },
    "cursos5a": {
      "es": "JavaScript Algorithms and Data Structures,",
      "en": "JavaScript Algorithms and Data Structures,"
    },
    "cursos5b": {
      "es": "freeCodeCamp.org, 2022.",
      "en": "freeCodeCamp.org, 2022."
    },
    "cursos6a": {
      "es": "Back End Development and APIs,",
      "en": "Back End Development and APIs,"
    },
    "cursos6b": {
      "es": "freeCodeCamp.org, 2022.",
      "en": "freeCodeCamp.org, 2022."
    },
    "experiencias1": { "es": "Experiencia Laboral", "en": "Work Experience" },
    "experiencias2a": {
      "es": "Programador. CompuHotel S.A. 1998 – 2002",
      "en": "Programmer. CompuHotel S.A. 1998 - 2002"
    },
    "experiencias2b": {
      "es": "Desarrollo de software de administración hotelera utilizando Visual Basic, Visual Fox Pro, y bases de datos SQL.",
      "en": "Hotel management software development using Visual Basic, Visual Fox Pro, and SQL databases."
    },
    "experiencias2c": {
      "es": "Diseño y desarrollo de páginas web utilizando HTML, CSS y JavaScript.",
      "en": "Design and development of web pages using HTML, CSS and Javascript."
    },
    "experiencias3a": {
      "es": "Sociólogo, Departamento de Salud Ambiental, Ministerio de Salud del GCABA. 2008 – 2012",
      "en": "Sociologist, Environmental Health Department, Ministry of Health of the Government of the Autonomous City of Buenos Aires. 2008 - 2012"
    },
    "experiencias3b": {
      "es": "Desarrollo e implementación de instrumentos para el relevamiento de problemáticas ambientales en los Centros de Salud y Acción Comunitaria de la CABA. Capacitación del personal para su utilización.",
      "en": "Development and implementation of instruments for the survey of environmental problems in the Health and Community Action Centers of the CABA. Training of personnel in their use."
    },
    "experiencias3c": {
      "es": "Análisis de datos socio-ambientales con Epi Info, bases de datos y SPSS.",
      "en": "Analysis of socio-environmental data using Epi Info, MS Access databases, and SPSS."
    },
    "experiencias4a": {
      "es": "Profesor y tutor universitario. Universidad de Buenos Aires. 2007 – 2015",
      "en": "Professor and university tutor. University of Buenos Aires. 2007 - 2015"
    },
    "experiencias4b": {
      "es": "Profesor de Introducción al Pensamiento Científico, Ciclo Básico Común, cátedra Marqués. 2007-2011",
      "en": "Professor of Introduction to Scientific Thinking, Common Basic Cycle, Marqués Chair. 2007-2011"
    },
    "experiencias4c": {
      "es": "Profesor y tutor de Prácticas de la enseñanza. Facultad de Ciencias Sociales, cátedra Pipkin. 2009-2015",
      "en": "Professor and tutor of Teaching Practices. Faculty of Social Sciences, Pipkin Chair. 2009-2015"
    },
    "experiencias5a": {
      "es": "Profesor de enseñanza media. 2010 – 2023",
      "en": "High school teacher. 2010 - 2023"
    },
    "experiencias5b": {
      "es": "Profesor de Sociología, Introducción a las Ciencias Sociales y a las Humanidades, Formación Ética y Ciudadana, e Historia, en escuelas públicas de enseñanza media de la Ciudad Autónoma de Buenos Aires.",
      "en": "Teacher of Sociology, History, Introduction to Social Sciences and Humanities, and Ethics and Citizenship Education in public high schools in the Autonomous City of Buenos Aires."
    }
  },
  "proyectos": {
    "codigo": {
      "es": "código",
      "en": "code"
    },
    "proyecto": {
      "es": "PROYECTO",
      "en": "PROJECT"
    },
    "anota01": {
      "es": "ANOTÁ! (Another Note Taking App) & Highlighter",
      "en": "ANOTÁ! (Another Note Taking App) & Highlighter"
    },
    "anota02": {
      "es": "Otra aplicación más para tomar notas. Pero con algunas características que ya quisiera tenerlas en Google Keep. Y lo mejor:  incorpora una extensión para el navegador (highlighter) que permite resaltar y guardar textos y enlaces desde cualquier web.",
      "en": "Yet another note-taking application. But with some features that I would like to have in Google Keep. And the best: it incorporates a browser extension (highlighter) that allows you to highlight and save texts and links from any web."
    },
    "anota03": {
      "es": "¿Qué tiene de bueno?",
      "en": "What's good about it?"
    },
    "anota04": {
      "es": "Permite crear, guardar y editar las notas desde la aplicación. La edición se puede realizar desde donde se ve la nota, sin tener que abrir otra una ventana.",
      "en": "It allows you to create, save and edit notes from the application. The edition can be done from where the note is seen, without having to open another window."
    },
    "anota05": {
      "es": "Las notas se pueden visualizar en modo lista o en modo mosaico, con la posibilidad de mostrar el título y el contenido, o solo el título,para así tener más en notas pantalla.",
      "en": "The notes can be viewed in list mode or in mosaic mode, with the possibility of showing the title and content, or only the title, to have more notes on the screen."
    },
    "anota06": {
      "es": "Cada nota puede tener múltiples etiquetas, que pueden utilizarse como filtros para ver solo algunas de ellas. También se pueden buscar las notas por texto en su título o contenido.",
      "en": "Each note can have multiple tags, which can be used as filters to see only some of them. Notes can also be searched by text in their title or content."
    },
    "anota07": {
      "es": "La extensión para el navegador (Highlighter) permite que simplemente al realizar una selección de texto en cualquier web, el texto se resalte y se guarde. Luego todos los fragmentos de texto seleccionados de una misma URL se pueden enviar a ANOTA y/o ser descargados en un archivo de texto. También se pueden generar notas guardando el enlace de la web, o toda la sesion de enlaces abiertos en el navegador.",
      "en": "The browser extension (Highlighter) allows you to simply make a text selection on any web, the text is highlighted and saved. Then all the selected text fragments from the same URL can be sent to ANOTA and/or downloaded in a text file. You can also generate notes by saving the web link, or the entire session of open links in the browser."
    },
    "anota08": {
      "es": "Mostrar un indicador en las notas que tenían más texto del que se veía en pantalla (sin mostrar las scroll bars), resulto ser un problema dado que hasta entonces no había utilizado React para acceder directamente al DOM mediante useRef. Aquí tuve que hacerlo, ya que la solución que se me ocurrió fue comparar si había diferencia entre el `scrollHeight` y el `clientHeight` del contenedor de la nota y así detectar si había un overflow del texto, y poder mostrar el indicador cuando correspondiera.",
      "en": "Displaying an indicator in the notes that had more text than was visible on the screen (without showing the scroll bars), turned out to be a problem since until then I had not used React to directly access the DOM using useRef. Here I had to do it, since the solution that occurred to me was to compare if there was a difference between the `scrollHeight` and the `clientHeight` of the note container and thus detect if there was an overflow of the text, and be able to show the indicator when appropriate."
    },
    "anota09": {
      "es": "Otras dificultades fueron la creación de un layout para mostrar las notas en modo mosaico, lo cual aún no se puede realizar de forma nativa en CSS. Así como también la implementación de un editor de texto para crear y modificar las notas, dado que el elemento HTML `contenteditable` no es muy versátil. En ambos casos, con la intención de poner rápidamente en funcionamiento la aplicación, opté por usar librerías, pero me quisiera poder estudiar en profundidad esos problemas para poder implementar mis propias soluciones ya que son aspectos importantes del proyecto.",
      "en": "Other difficulties were the creation of a layout to display the notes in mosaic mode, which cannot yet be done natively in CSS. As well as the implementation of a text editor to create and modify the notes, since the HTML element `contenteditable` is not very versatile. In both cases, with the intention of quickly putting the application into operation, I chose to use libraries, but I would like to be able to study those problems in depth in order to implement my own solutions since they are important aspects of the project."
    },
    "anota10": {
      "es": "En cuanto a la extensión del navegador, no fue nada fácil, dado que recientemente se cambió al manifest V3 (lo cual conlleva numerosas modificaciones en las APIs), y no abundan los materiales y ejemplos de código actualizados. Pero valió la pena el esfuerzo porque trabajar en una aplicación que tiene que manejar directamente el DOM me obligó a reforzar los fundamentos de JavaScript. Incluso me llevo a estudiar sobre estructuras de datos para poder resolver un problema que era recorrer el arbol del DOM desde el nodo de inicio de la selección de texto hasta el nodo final, para poder obtener el texto, resaltarlo, etc.",
      "en": "As for the browser extension, it was not easy at all, since it was recently changed to manifest V3 (which entails numerous modifications in the APIs), and there are not many updated materials and code examples. But it was worth the effort because working on an application that has to directly handle the DOM forced me to reinforce the fundamentals of JavaScript. It even led me to study about data structures to be able to solve a problem that was to traverse the DOM tree from the starting node of the text selection to the final node, in order to obtain the text, highlight it, etc."
    },
    "anota11": {
      "es": "Siendo esta la aplicación más grande que he realizado hasta ahora, me resultó aún más evidente la importancia de dedicarle tiempo a tener un código legible, estructurado, documentado, etc., así como también a tener componentes reutilizables y organizados. Es algo en lo que tengo que seguir trabajando y mejorando ya que es fundamental para poder mantener la aplicación e incorporarle nuevas funcionalidades.",
      "en": "Being this the largest application I have made so far, it became even more evident to me the importance of dedicating time to have readable, structured, documented code, etc., as well as having reusable and organized components. It is something I have to continue working on and improving since it is essential to be able to maintain the application and incorporate new functionalities."
    },
    "anota12": {
      "es": "Aprendizajes y problemas en el camino",
      "en": "Learnings and problems along the way"
    },
    "anota13": {
      "es": "Sobre el stack",
      "en": "About the stack"
    },
    "anota14": {
      "es": "Dado que estaba estudiando React, resultaba un oportunidad para poner en práctica el uso de hooks como useContext y useReducer para manejar el estado de la aplicación, así como también de useRef para manipular directamente el DOM.",
      "en": "Since I was studying React, it was an opportunity to put into practice the use of hooks such as useContext and useReducer to manage the state of the application, as well as useRef to manipulate the DOM directly."
    },
    "anota15": {
      "es": "Para el backend utilicé Node y Express por lo sencillo que resulta crear una API REST con endpoints, y que se conecta una base de datos. Implementé una en MySQL sin utilizar un ORM para aprender más sobre el funcionamiento de las bases de datos relacionales.",
      "en": "For the backend I used Node and Express because of how easy it is to create a REST API with endpoints, and that connects to a database. I implemented one in MySQL without using an ORM to learn more about the operation of relational databases."
    },
    "anota16": {
      "es": "Utilicé CSS modules por componentes, junto con la metodología BEM, con la intención de tener un código CSS claro y mantenible, separado de la lógica de la aplicación.",
      "en": "I used CSS modules by components, together with the BEM methodology, with the intention of having clear and maintainable CSS code, separated from the application logic."
    },
    "anota17": {
      "es": "La extensión está en puro HTML, CSS, y JavaScript. Pero decidí incorporar JSDoc para aprender a utilizarlo, tener un código mejor documentado, y también poder tener type check a través del language server de typescript.",
      "en": "The extension is in pure HTML, CSS, and JavaScript. But I decided to incorporate JSDoc to learn how to use it, have better documented code, and also be able to have type check through the typescript language server."
    },
    "anota18": {
      "es": "Muestra de las distintas posibilidades de visualización de las notas.",
      "en": "Shows the different possibilities of viewing the notes."
    },
    "anota19": {
      "es": "Funcionamiento de la extensión para el navegador.",
      "en": "The browser extension funcionality."
    },
    "anota20": {
      "es": "Muestra de la creación de notas y filtrado por etiquetas.",
      "en": "Shows the creation of notes and filtering by tags."
    }
  }
}
